Revit 2026 API

# BooleanOperationsUtils Properties

---

The BooleanOperationsUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

BooleanOperationsUtils Class

Autodesk.Revit.DB Namespace